CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_B1_11 (coord C13), KEY_BTUP */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTUP_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTUP_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTUP_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTUP_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTUP_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTUP_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_B1_09 (coord A13), KEY_BTLF */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTLF_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTLF_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTLF_CHANNEL                                       25U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTLF_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTLF_GPIO_PIN                                      25U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTLF_GPIO_PIN_MASK                         (1U << 25U)   /*!< GPIO pin mask */

/* GPIO_B1_10 (coord B13), KEY_BTOK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTOK_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTOK_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTOK_CHANNEL                                       26U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTOK_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTOK_GPIO_PIN                                      26U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTOK_GPIO_PIN_MASK                         (1U << 26U)   /*!< GPIO pin mask */

/* GPIO_B1_08 (coord A12), KEY_BTRT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTRT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTRT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTRT_CHANNEL                                       24U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTRT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTRT_GPIO_PIN                                      24U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTRT_GPIO_PIN_MASK                         (1U << 24U)   /*!< GPIO pin mask */

/* GPIO_B1_07 (coord B12), KEY_BTDN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTDN_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTDN_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTDN_CHANNEL                                       23U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO_PIN                                      23U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTDN_GPIO_PIN_MASK                         (1U << 23U)   /*!< GPIO pin mask */

/* GPIO_B1_06 (coord C12), BEEP_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_BEEP_EN_PERIPHERAL                                   GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_BEEP_EN_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_BEEP_EN_CHANNEL                                        22U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO                                         GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO_PIN                                       22U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_BEEP_EN_GPIO_PIN_MASK                          (1U << 22U)   /*!< GPIO pin mask */

/* GPIO_B1_05 (coord D12), SERVO_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SERVO_EN_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SERVO_EN_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_SERVO_EN_CHANNEL                                       21U   /*!< Signal channel */

