CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO_PIN                                      21U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_SERVO_EN_GPIO_PIN_MASK                         (1U << 21U)   /*!< GPIO pin mask */

/* GPIO_B1_04 (coord E12), KEY_BTSE */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTSE_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTSE_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTSE_CHANNEL                                       20U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO_PIN                                      20U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTSE_GPIO_PIN_MASK                         (1U << 20U)   /*!< GPIO pin mask */

/* GPIO_B1_02 (coord C11), MOTOR_EN */
/* Routed pin properties */
#define RTEPIN_ALLPIN_MOTOR_EN_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_MOTOR_EN_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_MOTOR_EN_CHANNEL                                       18U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO_PIN                                      18U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_MOTOR_EN_GPIO_PIN_MASK                         (1U << 18U)   /*!< GPIO pin mask */

/* GPIO_B1_01 (coord B11), KEY_BTME */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTME_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTME_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTME_CHANNEL                                       17U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO_PIN                                      17U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTME_GPIO_PIN_MASK                         (1U << 17U)   /*!< GPIO pin mask */

/* GPIO_B0_15 (coord E11), TOF0_XHT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF0_XHT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF0_XHT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF0_XHT_CHANNEL                                       15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO_PIN                                      15U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF0_XHT_GPIO_PIN_MASK                         (1U << 15U)   /*!< GPIO pin mask */

/* GPIO_B0_14 (coord E10), TOF0_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF0_INT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF0_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF0_INT_CHANNEL                                       14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO_PIN                                      14U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF0_INT_GPIO_PIN_MASK                         (1U << 14U)   /*!< GPIO pin mask */

/* GPIO_B0_13 (coord D10), TOF1_XHT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF1_XHT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF1_XHT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF1_XHT_CHANNEL                                       13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO_PIN                                      13U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF1_XHT_GPIO_PIN_MASK                         (1U << 13U)   /*!< GPIO pin mask */

/* GPIO_B0_12 (coord C10), TOF1_INT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_TOF1_INT_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_TOF1_INT_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_TOF1_INT_CHANNEL                                       12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO_PIN                                      12U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_TOF1_INT_GPIO_PIN_MASK                         (1U << 12U)   /*!< GPIO pin mask */

/* GPIO_B0_11 (coord A10), PWM2_B2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B2_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B2_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_B0_10 (coord D9), PWM2_A2 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_A2_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_A2_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_A2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_B0_09 (coord C9), PWM2_B1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B1_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B1_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B1_CHANNEL                                         1U   /*!< Signal channel */

