CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_B0_07 (coord A9), PWM2_B0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_B0_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_B0_SIGNAL                                           B   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_B0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_B0_06 (coord A8), PWM2_A0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_A0_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_A0_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_A0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_B0_05 (coord B8), I2C2_SDA */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C2_SDA_PERIPHERAL                                 LPI2C2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C2_SDA_SIGNAL                                        SDA   /*!< Signal name */

/* GPIO_B0_04 (coord C8), I2C2_SCL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_I2C2_SCL_PERIPHERAL                                 LPI2C2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_I2C2_SCL_SIGNAL                                        SCL   /*!< Signal name */

/* GPIO_B0_03 (coord D8), SPI4_SCK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SPI4_SCK_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SPI4_SCK_SIGNAL                                        SCK   /*!< Signal name */

/* GPIO_B0_02 (coord E8), SPI4_SDO */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SPI4_SDO_PERIPHERAL                                 LPSPI4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SPI4_SDO_SIGNAL                                        SDO   /*!< Signal name */

/* GPIO_B0_01 (coord E7), DISP_BKL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_BKL_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_BKL_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_BKL_CHANNEL                                        1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO_PIN                                       1U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_BKL_GPIO_PIN_MASK                          (1U << 1U)   /*!< GPIO pin mask */

/* GPIO_B0_00 (coord D7), DISP_D_C */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_D_C_PERIPHERAL                                  GPIO2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_D_C_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_D_C_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO                                        GPIO2   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_D_C_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_B1_12 (coord D13), UART5_TX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART5_TX_PERIPHERAL                                LPUART5   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART5_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_B1_13 (coord D14), UART5_RX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART5_RX_PERIPHERAL                                LPUART5   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART5_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_B1_15 (coord B14), PWM4_A3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM4_A3_PERIPHERAL                                    PWM4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM4_A3_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM4_A3_CHANNEL                                         3U   /*!< Signal channel */

/* GPIO_B1_14 (coord C14), PWM4_B3 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM4_A2_PERIPHERAL                                    PWM4   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM4_A2_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM4_A2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_EMC_41 (coord C7), DISP_RST */
/* Routed pin properties */
#define RTEPIN_ALLPIN_DISP_RST_PERIPHERAL                                  GPIO3   /*!< Peripheral name */
#define RTEPIN_ALLPIN_DISP_RST_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_DISP_RST_CHANNEL                                       27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_DISP_RST_GPIO                                        GPIO3   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_DISP_RST_GPIO_PIN                                      27U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_DISP_RST_GPIO_PIN_MASK                         (1U << 27U)   /*!< GPIO pin mask */

/* GPIO_SD_B0_00 (coord J4), SDHC_CMD */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_CMD_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_CMD_SIGNAL                                  usdhc_cmd   /*!< Signal name */

/* GPIO_SD_B0_01 (coord J3), SDHC_CLK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_CLK_PERIPHERAL                                 USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_CLK_SIGNAL                                  usdhc_clk   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), SDHC_D0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D0_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D0_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D0_CHANNEL                                         0U   /*!< Signal channel */

/* GPIO_SD_B0_03 (coord K1), SDHC_D1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SDHC_D1_PERIPHERAL                                  USDHC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SDHC_D1_SIGNAL                                  usdhc_data   /*!< Signal name */
#define RTEPIN_ALLPIN_SDHC_D1_CHANNEL                                         1U   /*!< Signal channel */

