CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* GPIO_AD_B1_05 (coord K12), CAM_XCLK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_XCLK_PERIPHERAL                                    CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_XCLK_SIGNAL                                   csi_mclk   /*!< Signal name */

/* GPIO_AD_B1_04 (coord L12), CAM_PCLK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_PCLK_PERIPHERAL                                    CSI   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_PCLK_SIGNAL                                 csi_pixclk   /*!< Signal name */

/* GPIO_AD_B1_03 (coord M12), CAM_RST */
/* Routed pin properties */
#define RTEPIN_ALLPIN_CAM_RST_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_CAM_RST_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_CAM_RST_CHANNEL                                        19U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_CAM_RST_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_CAM_RST_GPIO_PIN                                       19U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_CAM_RST_GPIO_PIN_MASK                          (1U << 19U)   /*!< GPIO pin mask */

/* GPIO_AD_B1_02 (coord L11), MOTOR_IR */
/* Routed pin properties */
#define RTEPIN_ALLPIN_MOTOR_IR_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_MOTOR_IR_SIGNAL                                         IN   /*!< Signal name */
#define RTEPIN_ALLPIN_MOTOR_IR_CHANNEL                                        7U   /*!< Signal channel */

/* GPIO_AD_B1_01 (coord K11), VOLT_BAT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_VOLT_BATT_PERIPHERAL                                  ADC2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_VOLT_BATT_SIGNAL                                        IN   /*!< Signal name */
#define RTEPIN_ALLPIN_VOLT_BATT_CHANNEL                                       6U   /*!< Signal channel */

/* GPIO_AD_B1_00 (coord J11), MOTOR_IL */
/* Routed pin properties */
#define RTEPIN_ALLPIN_MOTOR_IL_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_MOTOR_IL_SIGNAL                                         IN   /*!< Signal name */
#define RTEPIN_ALLPIN_MOTOR_IL_CHANNEL                                        5U   /*!< Signal channel */

/* GPIO_AD_B0_15 (coord L10), SERVO_IB */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SERVO_IB_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SERVO_IB_SIGNAL                                         IN   /*!< Signal name */
#define RTEPIN_ALLPIN_SERVO_IB_CHANNEL                                        4U   /*!< Signal channel */

/* GPIO_AD_B0_14 (coord H14), SERVO_IF */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SERVO_IF_PERIPHERAL                                   ADC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SERVO_IF_SIGNAL                                         IN   /*!< Signal name */
#define RTEPIN_ALLPIN_SERVO_IF_CHANNEL                                        3U   /*!< Signal channel */

/* GPIO_AD_B0_12 (coord K14), UART1_TX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART1_TX_PERIPHERAL                                LPUART1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART1_TX_SIGNAL                                         TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RX */
/* Routed pin properties */
#define RTEPIN_ALLPIN_UART1_RX_PERIPHERAL                                LPUART1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_UART1_RX_SIGNAL                                         RX   /*!< Signal name */

/* GPIO_AD_B0_07 (coord F12), SWCLK */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SWCLK_PERIPHERAL                                      JTAG   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SWCLK_SIGNAL                                           TCK   /*!< Signal name */

/* GPIO_AD_B0_06 (coord E14), SWDIO */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SWDIO_PERIPHERAL                                      JTAG   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SWDIO_SIGNAL                                           TMS   /*!< Signal name */

/* GPIO_AD_B0_05 (coord G14), BOOT_SEL1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_BOOT_SEL1_PERIPHERAL                                   SRC   /*!< Peripheral name */
#define RTEPIN_ALLPIN_BOOT_SEL1_SIGNAL                                 BOOT_MODE   /*!< Signal name */
#define RTEPIN_ALLPIN_BOOT_SEL1_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_AD_B0_04 (coord F11), BOOT_SEL0 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_BOOT_SEL0_PERIPHERAL                                   SRC   /*!< Peripheral name */
#define RTEPIN_ALLPIN_BOOT_SEL0_SIGNAL                                 BOOT_MODE   /*!< Signal name */
#define RTEPIN_ALLPIN_BOOT_SEL0_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_AD_B0_08 (coord F13), ENC_LA */
/* Routed pin properties */
#define RTEPIN_ALLPIN_ENC_LA_PERIPHERAL                                     ENC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_ENC_LA_SIGNAL                                        PHASE   /*!< Signal name */
#define RTEPIN_ALLPIN_ENC_LA_CHANNEL                                           A   /*!< Signal channel */

/* GPIO_AD_B0_09 (coord F14), ENC_LB */
/* Routed pin properties */
#define RTEPIN_ALLPIN_ENC_LB_PERIPHERAL                                     ENC1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_ENC_LB_SIGNAL                                        PHASE   /*!< Signal name */
#define RTEPIN_ALLPIN_ENC_LB_CHANNEL                                           B   /*!< Signal channel */

/* GPIO_AD_B0_11 (coord G10), ENCO_RA */
/* Routed pin properties */
#define RTEPIN_ALLPIN_ENC_RA_PERIPHERAL                                     ENC2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_ENC_RA_SIGNAL                                        PHASE   /*!< Signal name */
#define RTEPIN_ALLPIN_ENC_RA_CHANNEL                                           A   /*!< Signal channel */

/* GPIO_AD_B0_10 (coord G13), ENC_RB */
/* Routed pin properties */
#define RTEPIN_ALLPIN_ENC_RB_PERIPHERAL                                     ENC2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_ENC_RB_SIGNAL                                        PHASE   /*!< Signal name */
#define RTEPIN_ALLPIN_ENC_RB_CHANNEL                                           B   /*!< Signal channel */

/* GPIO_AD_B0_03 (coord G11), LED_USR */
/* Routed pin properties */
#define RTEPIN_ALLPIN_LED_USR_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_LED_USR_SIGNAL                                     gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_LED_USR_CHANNEL                                         3U   /*!< Signal channel */

