CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_LED_USR_GPIO                                         GPIO1   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_LED_USR_GPIO_PIN                                        3U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_LED_USR_GPIO_PIN_MASK                           (1U << 3U)   /*!< GPIO pin mask */

/* GPIO_AD_B0_02 (coord M11), LED_BUSG */
/* Routed pin properties */
#define RTEPIN_ALLPIN_LED_BUSG_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_LED_BUSG_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_LED_BUSG_CHANNEL                                        2U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_LED_BUSG_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_LED_BUSG_GPIO_PIN                                       2U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_LED_BUSG_GPIO_PIN_MASK                          (1U << 2U)   /*!< GPIO pin mask */

/* GPIO_AD_B0_01 (coord H10), KEY_BTUR */
/* Routed pin properties */
#define RTEPIN_ALLPIN_KEY_BTUS_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_KEY_BTUS_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_KEY_BTUS_CHANNEL                                        1U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_KEY_BTUS_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_KEY_BTUS_GPIO_PIN                                       1U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_KEY_BTUS_GPIO_PIN_MASK                          (1U << 1U)   /*!< GPIO pin mask */

/* GPIO_AD_B0_00 (coord M14), LED_BUSR */
/* Routed pin properties */
#define RTEPIN_ALLPIN_LED_BUSR_PERIPHERAL                                  GPIO1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_LED_BUSR_SIGNAL                                    gpio_io   /*!< Signal name */
#define RTEPIN_ALLPIN_LED_BUSR_CHANNEL                                        0U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define RTEPIN_ALLPIN_LED_BUSR_GPIO                                        GPIO1   /*!< GPIO peripheral base pointer */
#define RTEPIN_ALLPIN_LED_BUSR_GPIO_PIN                                       0U   /*!< GPIO pin number */
#define RTEPIN_ALLPIN_LED_BUSR_GPIO_PIN_MASK                          (1U << 0U)   /*!< GPIO pin mask */

/* GPIO_B0_08 (coord B9), PWM2_A1 */
/* Routed pin properties */
#define RTEPIN_ALLPIN_PWM2_A1_PERIPHERAL                                    PWM2   /*!< Peripheral name */
#define RTEPIN_ALLPIN_PWM2_A1_SIGNAL                                           A   /*!< Signal name */
#define RTEPIN_ALLPIN_PWM2_A1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_B1_00 (coord A11), MOTOR_FLT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_MOTOR_FLT_PERIPHERAL                                  AOI1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_MOTOR_FLT_SIGNAL                                       OUT   /*!< Signal name */
#define RTEPIN_ALLPIN_MOTOR_FLT_CHANNEL                                       0U   /*!< Signal channel */

/* GPIO_B1_03 (coord D11), SERVO_FLT */
/* Routed pin properties */
#define RTEPIN_ALLPIN_SERVO_FLT_PERIPHERAL                                  AOI1   /*!< Peripheral name */
#define RTEPIN_ALLPIN_SERVO_FLT_SIGNAL                                       OUT   /*!< Signal name */
#define RTEPIN_ALLPIN_SERVO_FLT_CHANNEL                                       1U   /*!< Signal channel */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_AllPin(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_Sdram(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void RTEPIN_QspiFlash(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
